readwrite/96_node/job_1471261_fiojob_32/nid00122_fiojob_32/output.log
readwrite: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 32 processes
readwrite: Laying out IO file (1 file / 1024MiB)
readwrite: Laying out IO file (1 file / 1024MiB)
readwrite: Laying out IO file (1 file / 1024MiB)
[...]

readwrite: (groupid=0, jobs=32): err= 0: pid=77420: Wed Jul 21 17:59:57 2021
  read: IOPS=43.5k, BW=170MiB/s (178MB/s)(49.9GiB/300522msec)
    slat (usec): min=7, max=1942.7k, avg=632.36, stdev=9869.51
    clat (usec): min=15, max=30157k, avg=93956.67, stdev=994985.97
     lat (usec): min=109, max=30287k, avg=94589.77, stdev=1002330.49
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   13], 10.00th=[   13], 20.00th=[   14],
     | 30.00th=[   14], 40.00th=[   14], 50.00th=[   14], 60.00th=[   15],
     | 70.00th=[   15], 80.00th=[   15], 90.00th=[   16], 95.00th=[   17],
     | 99.00th=[  313], 99.50th=[ 6678], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=  256, max=803193, per=100.00%, avg=179357.44, stdev=9285.81, samples=18233
   iops        : min=   64, max=200797, avg=44838.91, stdev=2321.43, samples=18233
  write: IOPS=43.6k, BW=170MiB/s (178MB/s)(49.9GiB/300522msec); 0 zone resets
    slat (usec): min=68, max=585693, avg=80.52, stdev=245.65
    clat (usec): min=11, max=30123k, avg=93115.29, stdev=993261.01
     lat (usec): min=92, max=30124k, avg=93196.92, stdev=993263.31
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   13], 10.00th=[   13], 20.00th=[   14],
     | 30.00th=[   14], 40.00th=[   14], 50.00th=[   14], 60.00th=[   15],
     | 70.00th=[   15], 80.00th=[   15], 90.00th=[   16], 95.00th=[   17],
     | 99.00th=[  251], 99.50th=[ 6544], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=  256, max=801661, per=100.00%, avg=179132.15, stdev=9288.29, samples=18276
   iops        : min=   64, max=200414, avg=44782.59, stdev=2322.05, samples=18276
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=97.65%, 50=1.17%
  lat (msec)   : 100=0.08%, 250=0.09%, 500=0.06%, 750=0.02%, 1000=0.05%
  lat (msec)   : 2000=0.05%, >=2000=0.82%
  cpu          : usr=2.58%, sys=13.14%, ctx=116564, majf=0, minf=1416
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=13084282,13087880,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=170MiB/s (178MB/s), 170MiB/s-170MiB/s (178MB/s-178MB/s), io=49.9GiB (53.6GB), run=300522-300522msec
  WRITE: bw=170MiB/s (178MB/s), 170MiB/s-170MiB/s (178MB/s-178MB/s), io=49.9GiB (53.6GB), run=300522-300522msec